app1/esquisse/app/views/favorites/view.html.erb

      <% @favorites.each do |like| %>
        <% photo = Photo.find_by(id: like.photo_id) %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

                  <div class="card-content">
                    <p><%= photo.content %> (<%= photo.favorite_user.count %>)</p>
---
SELECT COUNT(*) FROM "favorites"
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", 1]]