app1/esquisse/app/views/photos/index.html.erb

  <h2>MyPhoto</h2>
  <% @user.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]