app1/esquisse/app/views/photos/show.html.erb

  </div>
  <p>good: <%= @photo.favorites.count %></p>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."photo_id" = ?  [["photo_id", 16]]