app1/esquisse/app/views/photos/view.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" ASC
---
          <!--いいね件数表示-->
          (<%= photo.favorite_user.count %>)