timer_app/app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    #全ユーザー情報を取得
    @users = User.all.order(created_at: :desc)

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at", "image_name") VALUES (?, ?, ?, ?, ?)  [["name", "saburo"], ["password_digest", "1233"], ["created_at", "2019-11-25 09:15:55.925635"], ["updated_at", "2019-11-25 09:15:55.925635"], ["image_name", "default_user.png"]]
---
  def create
    #新規ユーザー登録アクション
    @user = User.new(
      name: params[:name],
      password_digest: params[:password_digest],
      image_name: "default_user_image.png"
    )

    @repassword = params[:repassword]

    #パスワードチェック
    unless @user.password_digest == @repassword
      #パスワードが一致しなかった場合、リターンする
      flash[:notice] = "パスワードが一致しませんでした"
      render("/users/new")
      return
    end

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "logs".* FROM "logs" ORDER BY "logs"."created_at" DESC
---
  def show
    #ユーザーの個別情報を取得
    @user = User.find_by(id: params[:id])

    #ユーザーの学習記録情報を取得
    @logs = Log.all.order(created_at: :desc)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    #ユーザーの個別情報を取得
    @user = User.find_by(id:params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "1234"], ["updated_at", "2019-11-26 13:58:22.643011"], ["id", 3]]
---
  def update
    @user = User.find_by(id:params[:id])
    @user.name = params[:name]
    @user.password_digest = params[:password_digest]

    #画像の保存処理
    if params[:image]
      @user.image_name = "#{@user.id}.jpg"

      image = params[:image]

      File.binwrite("public/user_image/#{@user.image_name}",image.read)
    end

    #ユーザー情報の更新処理
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def record
    require 'date'
    #ユーザー情報を取得
    @user = User.find_by(id:params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "logs" ("user_id", "user_name", "start_time", "menu", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["user_name", "saburo"], ["start_time", "2019-11-27 09:01:23.626839"], ["menu", "test"], ["created_at", "2019-11-27 09:01:23.627321"], ["updated_at", "2019-11-27 09:01:23.627321"]]
---
  def record_create
    require 'date'
    #ユーザーIDを取得
    @user = User.find_by(id:params[:id])

    #記録作成
    @logs = Log.new(
      user_id: @user.id,
      user_name: @user.name,
      #start_time: params[:start_time],
      start_time: DateTime.now,
      menu: params[:menu]
    )

    #記録保存処理
    if @logs.save

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def record_edit
    #学習記録情報を取得
    @logs = Log.find_by(id:params[:id])

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "logs" SET "end_time" = ?, "menu" = ?, "updated_at" = ? WHERE "logs"."id" = ?  [["end_time", "2019-12-01 14:57:48"], ["menu", "rails学習開始\r\n一旦休憩"], ["updated_at", "2019-12-01 05:58:00.557905"], ["id", 22]]
---
  def record_update

    @logs = Log.find_by(id:params[:id])

    @logs.end_time = params[:end_time]
    @logs.menu = params[:menu]

    if !start_end_check?(params[:start_time],params[:end_time])
      render("/users/record_edit")
      return
    end

    #学習記録更新処理
    if @logs.save

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def view
    #学習記録情報を取得
    @logs = Log.find_by(id:params[:id])

SELECT "logs".* FROM "logs" WHERE "logs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "logs" WHERE "logs"."id" = ?  [["id", 6]]
---
  def record_destroy
    @logs = Log.find_by(id:params[:id])
    @id = @logs.user_id
    #学習記録を削除
    @logs.destroy

SELECT "users".* FROM "users" WHERE "users"."name" = ? AND "users"."password_digest" = ? LIMIT ?  [["name", "taro"], ["password_digest", "1234"], ["LIMIT", 1]]
---
  def login
        #ユーザー名とパスワードが一致する情報を取得
    @user = User.find_by(
      name: params[:name],
      password_digest: params[:password_digest]
      )