labo/gemtest/app/controllers/likes_controller.rb

  def create
    @like = current_user.likes.create(post_id: params[:post_id])
---
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 3], ["user_id", 2], ["created_at", "2019-12-06 13:44:23.895823"], ["updated_at", "2019-12-06 13:44:23.895823"]]