labo/gemtest/app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", ""], ["user_id", 1], ["created_at", "2019-12-06 13:37:49.900231"], ["updated_at", "2019-12-06 13:37:49.900231"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save