labo/gemtest/app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    #@users = User.all
    @users = User.page(params[:page]).per(PER)