labo/cordinator/app/controllers/events_controller.rb

  def update
    @event = Event.find(params[:id])
    #参会者登録処理
    #検証中
    if params[:name] != nil
      @event.candidate_count += "///「name:" + params[:name] +
                              "」//「status:" + params[:hidden_status_data] +
                              "」"
      else
        render("/share/#{@event.id}/#{@event.url}")
    end


    if @event.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "events" SET "candidate_count" = ?, "updated_at" = ? WHERE "events"."id" = ?

  def set_event_url
    @event_url = Event.find_by(url_token: params[:url_token])
---
SELECT "events".* FROM "events" WHERE "events"."url_token" IS NULL LIMIT ?  [["LIMIT", 1]]