labo/cordinator/app/controllers/events_controller.rb

  def create
    require 'securerandom'

    @event = Event.new(
      title: params[:title],
      memo: params[:memo],
      candidate_date: params[:calendar],
      url: SecureRandom.urlsafe_base64,
      candidate_count: "0人"
    )
    count = params[:calendar].count('\n')

    #@event.candidate_count = "0人-0人-0人/" * count

    if @event.save
---
INSERT INTO "events" ("title", "candidate_date", "memo", "url", "created_at", "updated_at", "candidate_count") VALUES (?, ?, ?, ?, ?, ?, ?)

  def view
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def share
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @event = Event.find(params[:id])
    #参会者登録処理
    #検証中
    if params[:name] != nil
      @event.candidate_count += "///「name:" + params[:name] +
                              "」//「status:" + params[:hidden_status_data] +
                              "」"
      else
        render("/share/#{@event.id}/#{@event.url}")
    end


    if @event.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "events" SET "candidate_count" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["candidate_count", "0人///name:saburo///status:○/▲/✖︎//////name:jiro///status:○/○/○//////name:jiro///status:○/▲/✖︎///"], ["updated_at", "2020-01-01 23:00:07.527287"], ["id", 22]]

  def set_event_url
    @event_url = Event.find_by(url_token: params[:url_token])
---
SELECT "events".* FROM "events" WHERE "events"."url_token" IS NULL LIMIT ?  [["LIMIT", 1]]