labo/cordinator/app/controllers/events_controller.rb

  def set_event_url
    @event_url = Event.find_by(url_token: params[:url_token])
---
SELECT "events".* FROM "events" WHERE "events"."url_token" IS NULL LIMIT ?  [["LIMIT", 1]]