app1/esquisse/app/controllers/favorites_controller.rb

    def create
    @fav = current_user.favorites.create(photo_id: params[:photo_id])
---
INSERT INTO "favorites" ("photo_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["photo_id", 14], ["user_id", 1], ["created_at", "2019-12-16 11:22:42.506220"], ["updated_at", "2019-12-16 11:22:42.506220"]]

  def destroy
    @fav = Favorite.find_by(photo_id: params[:photo_id], user_id: current_user.id)
    @fav.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."photo_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["photo_id", 7], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 20]]

  def view
    @user = User.find(params[:id])
    @favorites = Favorite.where(user_id: @user.id)
    #ページング(作成日時の降順に表示させるよう修正の必要あり)
    @fav = Favorite.page(params[:page]).per(PER)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "favorites"
SELECT "favorites".* FROM "favorites" LIMIT ?  [["LIMIT", 1]]