app1/esquisse/app/controllers/photos_controller.rb

INSERT INTO "photos" ("content", "user_id", "created_at", "updated_at", "image_name") VALUES (?, ?, ?, ?, ?)
---
  def create
    require 'date'

    @photo = Photo.new(
      user_id: current_user.id,
      content: params[:content]
      )

    #画像の保存処理
    if params[:image_name]
      time= DateTime.now
      @photo.image_name = time.strftime("%Y %-m %-d %-H %-M %-S") + ".jpg"
      image = params[:image_name]

      File.binwrite("public/post_images/#{@photo.image_name}",image.read)
    end

    #保存処理
    if @photo.save