app1/esquisse/app/controllers/photos_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    if current_user
      @user = User.find(current_user.id)

INSERT INTO "photos" ("content", "user_id", "created_at", "updated_at", "image_name") VALUES (?, ?, ?, ?, ?)  [["content", "te"], ["user_id", 1], ["created_at", "2019-12-15 14:35:15.921368"], ["updated_at", "2019-12-15 14:35:15.921368"], ["image_name", "20191215233515.jpg"]]
---
  def create
    require 'date'

    @photo = Photo.new(
      user_id: current_user.id,
      content: params[:content]
      )

    #画像の保存処理
    if params[:image_name]
      time= DateTime.now
      @photo.image_name = time.strftime("%Y%-m%-d%-H%-M%-S") + ".jpg"
      image = params[:image_name]
      File.binwrite("public/post_images/#{@photo.image_name}",image.read)
    end

    #保存処理
    if @photo.save

SELECT "photos".* FROM "photos" ORDER BY "photos"."created_at" DESC
SELECT COUNT(*) FROM "photos"
SELECT "photos".* FROM "photos" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def view
    #ransack
    #@q = User.includes(photos: :content).ransack(params[:q])
    @q = Photo.ransack(params[:q])

    #作成日時の降順になるようソート
    @q.sorts   = 'created_at desc' if @q.sorts.empty?

    @ask = @q.result(distinct: true)


    #ページング(作成日時の降順に表示させるよう修正の必要あり)
    @photos = Photo.page(params[:page]).per(PER)

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 14]]
---
  def post_destroy
    @photo = Photo.find_by(id:params[:id])
    #投稿を削除
    @photo.destroy

SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 9]]
---
  def fav_cancel
    @fav = Favorite.find_by(id:params[:id])
    @fav = Favorite.find_by(id:9)
    @fav.destroy