app1/esquisse/app/controllers/users_controller.rb

  def profile
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find_by(id:params[:id])
    @user.name = params[:name]
    @user.password = params[:password]
    @user.profile = params[:profile]

    #パスワードが不一致だったときの処理
    if @user.password != params[:repassword]
      flash[:notice] = "パスワードが一致しません"
      render("/users/profile")
      return
    end

    #画像の保存処理
    if params[:image_name]
      @user.image_name = "#{@user.id}.jpg"

      image = params[:image]

      File.binwrite("public/user_image/#{@user.image_name}",image.read)
    end

    #ユーザー情報の更新処理
    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "encrypted_password" = ?, "profile" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "saburo"], ["encrypted_password", "$2a$11$8s1mp9XLpP8LlBZqJNI8sO/4K75mhSICx43sNJ4Pdmfmz4izoFui."], ["profile", ""], ["updated_at", "2019-12-15 14:27:52.243391"], ["id", 1]]