app1/esquisse/app/models/user.rb

SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."photo_id" = ? LIMIT ?  [["user_id", 2], ["photo_id", 1], ["LIMIT", 1]]
---
  def already_fav?(photo)
    self.favorites.exists?(photo_id: photo.id)