app1/esquisse/app/views/users/show.html.erb

<h2>投稿内容</h2>
<% @user.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]